src/main/resources/reports/stage2/put_results/wrk_put_poll.txt
Running 10s test @ http://localhost:8080
  1 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.50ms    1.44ms  29.57ms   95.22%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.28ms
 75.000%    1.78ms
 90.000%    2.33ms
 99.000%    8.14ms
 99.900%   17.68ms
 99.990%   28.51ms
 99.999%   29.57ms
100.000%   29.58ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.040     0.000000            1         1.00
       0.530     0.100000         9019         1.11
       0.737     0.200000        18029         1.25
       0.919     0.300000        27043         1.43
       1.099     0.400000        35999         1.67
       1.280     0.500000        45039         2.00
       1.372     0.550000        49539         2.22
       1.464     0.600000        54013         2.50
       1.563     0.650000        58498         2.86
       1.668     0.700000        63030         3.33
       1.783     0.750000        67503         4.00
       1.847     0.775000        69741         4.44
       1.917     0.800000        72008         5.00
       1.995     0.825000        74240         5.71
       2.085     0.850000        76523         6.67
       2.191     0.875000        78749         8.00
       2.257     0.887500        79886         8.89
       2.331     0.900000        81001        10.00
       2.421     0.912500        82111        11.43
       2.531     0.925000        83239        13.33
       2.681     0.937500        84363        16.00
       2.773     0.943750        84922        17.78
       2.899     0.950000        85486        20.00
       3.049     0.956250        86050        22.86
       3.225     0.962500        86612        26.67
       3.513     0.968750        87176        32.00
       3.717     0.971875        87453        35.56
       3.909     0.975000        87733        40.00
       4.235     0.978125        88015        45.71
       4.763     0.981250        88295        53.33
       5.687     0.984375        88577        64.00
       6.279     0.985938        88719        71.11
       6.867     0.987500        88859        80.00
       7.699     0.989062        88998        91.43
       8.431     0.990625        89139       106.67
       9.303     0.992188        89280       128.00
       9.839     0.992969        89352       142.22
      10.263     0.993750        89421       160.00
      10.751     0.994531        89492       182.86
      11.447     0.995313        89561       213.33
      12.367     0.996094        89631       256.00
      12.847     0.996484        89667       284.44
      13.351     0.996875        89701       320.00
      13.807     0.997266        89737       365.71
      14.391     0.997656        89772       426.67
      15.391     0.998047        89807       512.00
      15.927     0.998242        89824       568.89
      16.399     0.998437        89844       640.00
      16.703     0.998633        89859       731.43
      17.071     0.998828        89877       853.33
      17.951     0.999023        89895      1024.00
      18.335     0.999121        89903      1137.78
      18.975     0.999219        89912      1280.00
      19.599     0.999316        89921      1462.86
      20.175     0.999414        89930      1706.67
      20.527     0.999512        89940      2048.00
      20.607     0.999561        89943      2275.56
      20.943     0.999609        89947      2560.00
      21.455     0.999658        89952      2925.71
      21.887     0.999707        89956      3413.33
      22.975     0.999756        89961      4096.00
      23.807     0.999780        89963      4551.11
      24.815     0.999805        89965      5120.00
      25.439     0.999829        89967      5851.43
      26.223     0.999854        89969      6826.67
      27.903     0.999878        89972      8192.00
      28.511     0.999890        89973      9102.22
      28.799     0.999902        89974     10240.00
      28.815     0.999915        89975     11702.86
      29.103     0.999927        89976     13653.33
      29.119     0.999939        89977     16384.00
      29.263     0.999945        89978     18204.44
      29.263     0.999951        89978     20480.00
      29.295     0.999957        89979     23405.71
      29.295     0.999963        89979     27306.67
      29.343     0.999969        89980     32768.00
      29.343     0.999973        89980     36408.89
      29.343     0.999976        89980     40960.00
      29.567     0.999979        89981     46811.43
      29.567     0.999982        89981     54613.33
      29.567     0.999985        89981     65536.00
      29.567     0.999986        89981     72817.78
      29.567     0.999988        89981     81920.00
      29.583     0.999989        89982     93622.86
      29.583     1.000000        89982          inf
#[Mean    =        1.501, StdDeviation   =        1.444]
#[Max     =       29.568, Total count    =        89982]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  89992 requests in 10.00s, 6.35MB read
Requests/sec:   8998.93
Transfer/sec:    650.31KB